FreeCAD/CfdOF/testFiles/cases/block/constant/polyMesh/boundary
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  inlet

  {
    type patch;
    nFaces 54;
    startFace 2452;

  }
  outlet

  {
    type patch;
    nFaces 54;
    startFace 2506;

  }
  wall

  {
    type patch;
    nFaces 108;
    startFace 2560;

  }
  slip

  {
    type patch;
    nFaces 896;
    startFace 2668;

  }
)
