FreeCAD/CfdOF/testFiles/cases/block/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0.0 0.0 0.0);

boundaryField
{
  inlet
  {
    fixTangentialInflow yes;
    normalVelocity
    {
      type fixedValue;
      value uniform (1 0 0);
    }
    type fixedNormalInletOutletVelocity;
    value uniform (1 0 0);
  }
  outlet
  {
    type pressureInletOutletVelocity;
    value $internalField;
  }
  wall
  {
    type fixedValue;
    value uniform (0 0 0);
  }
  slip
  {
    type slip;
  }
}

